---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrent
source: html/76a31fda-45cb-2f7b-4296-6e174d0990d3.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrent Property

The ApparentCurrent value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentCurrent { get; }
```

## Remarks
This property is used to retrieve the ApparentCurrent value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!